# Домашнее задание HWF -- Фибоначчиевый ним

Два игрока играют в интересную игру: изначально дано N спичек. Первый игрок берёт любое количество, но не все сразу спички. Теперь второй может взять не больше, чем вдвое больше чем первый. Далее первый берёт не больше чем вдвое больше второго. И так далее. Выигрывает тот, кто взял последнюю спичку

Партия 1:

11 спичек. Первый берёт 4, второй может взять до 8 и берёт 7, победа. Запись партии: 11.4,7!

Партия 2:

11.3,3,5!

Партия 3:

11.3.2.1.1.1.1.2!

Ваша посылка должна состоять из функции, которая по общему количеству оставшихся (total) и количеству допустимых к взятию (possible) спичек будет возвращать сколько спичек она хочет взять

Разумеется, ваша функция всегда должна делать оптимальный ход

Если оптимальный ход невозможен (все ходы плохи), разумно взять одну спичку и дать противнику шанс сделать ошибку

int next_turn(int total, int possible) {
  // TODO: ваш код здесь
}


СТАРТОВАЯ ТОЧКА:

#include <assert.h>
#include <stdio.h>
#include <stdlib.h>

int next_turn(int total, int possible);

int main()
{
    int n, q, res;

    res = scanf("%d%d", &n, &q);
    assert(res == 2);

    n = next_turn(n, q);
    printf("%d\n", n);

    return 0;
}

.

## Build Instructions
Для сборки проекта выполните:
```bash
make
```
Для теста программы выполните:
```bash
make test

